stemChamber_transport_long/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0.01;

stopAt          endTime;

endTime         200.02;

deltaT          0.001;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //

functions
{

///////////////////////////////////////////////////////////////////////////

minmaxdomain
{
    type fieldMinMax;

    functionObjectLibs ("libfieldFunctionObjects.so");

    enabled true; //true or false

    mode component;

    writeControl timeStep;
    writeInterval 1;

    log true;

    fields (p U);
}

ch4
{
	type            scalarTransport;
	functionObjectLibs ("libsolverFunctionObjects.so");

	enabled true;

	writeControl outputTime;
	//writeControl timeStep;
	//writeInterval 1;

	log yes;

	nCorr 1;

	//difussion coefficient
	D 0.000021;

	//name of field
	field ch4;

	//use the schemes of field, in this case, U
	//schemesField U;

}

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
/*
residuals
{
	functionObjectLibs ("libutilityFunctionObjects.so");

	type residuals;

	enabled true; 

	writeControl timeStep;
	writeInterval 1;

	fields (p U);
}
*/
///////////////////////////////////////////////////////////////////////////

};
