stemChamber_transport_long/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
/*        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
*/

        solver           GAMG;
        tolerance        1e-6;
        relTol           0.0;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;

    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
    /*    solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    */
	solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	minIter		1;
    }

    ch4
    {
	solver		PBiCGStab;
	preconditioner	DILU;
	tolerance	1e-08;
	reltol		0;
	minIter		1;
    }
}

PISO
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
