stemChamber_transport_long/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
actions
(
    {
        name    inlet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.04 0.075 0.0450) (0.049 0.075 0.050);
        }
    }

    {
	name	outlet;
	type	faceSet;
	action	new;
	source	boxToFace;
	sourceInfo
	{
	    box (0.154 0.075 0.0450) (0.159 0.075 0.050);
	}
    } 

);

// ************************************************************************* //
